In [1]:
import pandas as pd
import os
print(os.path.abspath('../'))

# set the path where you have downloaded the data files
file_path = os.path.abspath('../class2')
print(file_path)

train = pd.read_csv(file_path+'/train_income_data_AAII.csv')
test = pd.read_csv(file_path+'/test_income_data_AAII.csv')

# For windows, if the above paths doesn't works
# import os
# f_path = os.path.join(*['C:', 'Users', 'user', 'Desktop', 'train_income_data_AAII.csv'])
# train = pd.read_csv(f_path)

# or maybe try following to reach to the path
# absolute_path = os.path.abspath(os.path.dirname('train_income_data_AAII.csv'))

C:\Users\Sheikh M Muneer\Documents
C:\Users\Sheikh M Muneer\Documents\class2

In [2]:
f_path = os.path.join(*['C:', 'Users', 'Sheikh M Muneer','Documents', 'class2','train_income_data_AAII.csv'])
f_path

'C:Users\\Sheikh M Muneer\\Documents\\class2\\train_income_data_AAII.csv'

In [4]:
type(train)

pandas.core.frame.DataFrame

In [5]:
train.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
0,1,39,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,2,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,3,38,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,4,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,5,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K

In [6]:
train.tail()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
32556,32557,27,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,38,United-States,<=50K
32557,32558,40,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,40,United-States,>50K
32558,32559,58,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,40,United-States,<=50K
32559,32560,22,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,20,United-States,<=50K
32560,32561,52,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,40,United-States,>50K

In [7]:
# Get dimensions of your data
train.shape

(32561, 12)

In [8]:
train.describe()

                 ID           Age  Hours.Per.Week
count  32561.000000  32561.000000    32561.000000
mean   16281.000000     38.581647       40.437456
std     9399.695394     13.640433       12.347429
min        1.000000     17.000000        1.000000
25%     8141.000000     28.000000       40.000000
50%    16281.000000     37.000000       40.000000
75%    24421.000000     48.000000       45.000000
max    32561.000000     90.000000       99.000000

## Continuous Variable

In [9]:
train.dtypes

ID                 int64
Age                int64
Workclass         object
Education         object
Marital.Status    object
Occupation        object
Relationship      object
Race              object
Sex               object
Hours.Per.Week     int64
Native.Country    object
Income.Group      object
dtype: object

## Categorical Variables

In [10]:
categorical_var = train.dtypes.loc[train.dtypes=='object']
print(categorical_var)

Workclass         object
Education         object
Marital.Status    object
Occupation        object
Relationship      object
Race              object
Sex               object
Native.Country    object
Income.Group      object
dtype: object

In [11]:
categorical_var = train.dtypes.loc[train.dtypes=='object'].index
print(categorical_var)

Index(['Workclass', 'Education', 'Marital.Status', 'Occupation',
       'Relationship', 'Race', 'Sex', 'Native.Country', 'Income.Group'],
      dtype='object')

In [25]:
#Number of Unique values in each column
train[categorical_var].apply(lambda x:len(x.unique()))  # apply apply on every element

Workclass          9
Education         16
Marital.Status     7
Occupation        15
Relationship       6
Race               5
Sex                2
Native.Country    42
Income.Group       2
dtype: int64

In [12]:
# What happened up there??

In [22]:
train['Workclass'].unique()

array(['State-gov', 'Self-emp-not-inc', 'Private', 'Federal-gov',
       'Local-gov', nan, 'Self-emp-inc', 'Without-pay', 'Never-worked'],
      dtype=object)

In [13]:
len(train['Workclass'].unique())

9

In [10]:
# Here we can see that 6 variables have less than 10 unique values but others have 15 or more unique values which seem to be too high.
# Pandas dataframes have an inbuilt routine called value_counts which gives the count of each category.
# We'll take 2 examples here to perform univariate analysis.

In [15]:
# Print counts of each category
train['Race'].value_counts()

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: Race, dtype: int64

In [16]:
# Percentage of observations in each category:
train['Race'].value_counts()/train.shape[0]*100

White                 85.427352
Black                  9.594300
Asian-Pac-Islander     3.190934
Amer-Indian-Eskimo     0.955130
Other                  0.832284
Name: Race, dtype: float64

In [17]:
# Here we observe that the top variable itself accounts for ~85% of observations and top 2 combined have ~95% of observations.
# You should keep these observations in mind.

In [18]:
# Lets Observe Native.Country's column

In [21]:
train['Native.Country'].value_counts()/train.shape[0]*100

United-States                 89.585701
Mexico                         1.974755
Philippines                    0.608089
Germany                        0.420749
Canada                         0.371610
Puerto-Rico                    0.350112
El-Salvador                    0.325543
India                          0.307116
Cuba                           0.291760
England                        0.276404
Jamaica                        0.248764
South                          0.245693
China                          0.230337
Italy                          0.224195
Dominican-Republic             0.214981
Vietnam                        0.205768
Guatemala                      0.196554
Japan                          0.190412
Poland                         0.184270
Columbia                       0.181198
Taiwan                         0.156629
Haiti                          0.135131
Iran                           0.132060
Portugal                       0.113633
Nicaragua                      0.104419
Peru                           0.095206
Greece                         0.089064
France                         0.089064
Ecuador                        0.085992
Ireland                        0.073708
Hong                           0.061423
Trinadad&Tobago                0.058352
Cambodia                       0.058352
Laos                           0.055281
Thailand                       0.055281
Yugoslavia                     0.049139
Outlying-US(Guam-USVI-etc)     0.042996
Hungary                        0.039925
Honduras                       0.039925
Scotland                       0.036854
Holand-Netherlands             0.003071
Name: Native.Country, dtype: float64

In [22]:
# Here we see that around 89.5 % of our training data belongs to United States

In [30]:
train['Sex'].value_counts()

Male      21790
Female    10771
Name: Sex, dtype: int64

In [34]:
train['Sex'].value_counts()/train.shape[0]*100

Male      66.920549
Female    33.079451
Name: Sex, dtype: float64

In [32]:
train.groupby('Sex')['Age'].mean()

Sex
Female    36.858230
Male      39.433547
Name: Age, dtype: float64

In [36]:
df4 = train.groupby(['Sex','Race'])['Age'].mean()
df4

Sex     Race
Female  Amer-Indian-Eskimo    37.117647
        Asian-Pac-Islander    35.089595
        Black                 37.854019
        Other                 31.678899
        White                 36.811618
Male    Amer-Indian-Eskimo    37.208333
        Asian-Pac-Islander    39.073593
        Black                 37.682600
        Other                 34.654321
        White                 39.652498
Name: Age, dtype: float64

In [41]:
train.sort_values(by='Age').head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
12318,12319,17,Private,11th,Never-married,Sales,Own-child,White,Female,8,United-States,<=50K
6312,6313,17,Private,11th,Never-married,Sales,Own-child,White,Male,15,United-States,<=50K
30927,30928,17,Private,11th,Never-married,Other-service,Own-child,Black,Male,17,United-States,<=50K
12787,12788,17,Local-gov,11th,Never-married,Adm-clerical,Own-child,White,Female,15,United-States,<=50K
25755,25756,17,NaN,11th,Never-married,NaN,Own-child,White,Male,10,United-States,<=50K

In [40]:
train.sort_values(by='Age',ascending=False).head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
5406,5407,90,Private,Masters,Never-married,Exec-managerial,Not-in-family,Black,Male,50,United-States,>50K
6624,6625,90,Private,11th,Married-civ-spouse,Craft-repair,Husband,White,Male,40,United-States,<=50K
20610,20611,90,Private,Masters,Married-civ-spouse,Prof-specialty,Wife,White,Female,40,United-States,>50K
1040,1041,90,Private,HS-grad,Never-married,Other-service,Not-in-family,White,Female,40,United-States,<=50K
1935,1936,90,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,45,United-States,<=50K

In [43]:
train.sort_values(by= ['Age','Hours.Per.Week'],ascending=False).head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
15356,15357,90,Private,HS-grad,Widowed,Transport-moving,Unmarried,White,Male,99,United-States,<=50K
8806,8807,90,Private,Prof-school,Married-civ-spouse,Prof-specialty,Husband,White,Male,72,United-States,>50K
5370,5371,90,Local-gov,Masters,Married-civ-spouse,Exec-managerial,Husband,White,Male,60,United-States,>50K
11996,11997,90,Private,Bachelors,Never-married,Exec-managerial,Not-in-family,White,Male,55,United-States,<=50K
5406,5407,90,Private,Masters,Never-married,Exec-managerial,Not-in-family,Black,Male,50,United-States,>50K